# Пишем калькулятор BMI
# Что должен делать
# 1.Запрашиваем рост/вес
# 2.Считать BMI по введенным параметрам
# 3.Выводить результат в виде текста - Ваш индекс массы тела: <результат расчета>
# 4.Выводить результат в виде шкалы: Пример: Если результат 30
# 20======|============50
# Если 40
# 20============|======50


height = input("Введите Ваш рост сантиметрах: ")
weight = input("Введите Ваш вес в килограммах: ")
age = int(input("Введите свой возраст: "))
sex = input("Введите пол М или Ж: ")
bmi = round(float(weight)/(float(height)/100)**2, 1)       # расчет bmi, округляем до десятых
cost = round((50-20)/19, 2)                                # считаем цену '=' как в примере
before_pipe = int((bmi-16)/cost)                           # кол-во целых '=' до '|'
after_pipe = int((50-bmi+0.76)/cost)                       # кол-во целых '=' после '|', истинный размер шкалы 50.76
print("Ваш индекс массы тела:", bmi)
print("16" + before_pipe*"=" + "|" + after_pipe*"=" + "50")

# Доделать BMI: Дозапросить пол и возраст Выдавать рекомендации 10 градаций: 2 пола и по 3 рекомендаци для каждого + возраст

# Возраст: до 30, от 30 до 60, больше 60
# диагноз bmi: дефицит, норма, избыточная
recomendations = dict(
                 men_deficit_til30=["Рекомендация 1","Рекомендация 2","Рекомендация 3"],
                 men_deficit_30to60=["Рекомендация 4","Рекомендация 5","Рекомендация 6"],
                 men_deficit_after60=["Рекомендация 7","Рекомендация 8","Рекомендация 9"],
                 men_normal_til30=["Рекомендация 10","Рекомендация 11","Рекомендация 12"],
                 men_normal_30to60=["Рекомендация 13","Рекомендация 14","Рекомендация 15"],
                 men_normal_after60=["Рекомендация 16","Рекомендация 17","Рекомендация 18"],
                 men_excess_til30=["Рекомендация 19","Рекомендация 20","Рекомендация 21"],
                 men_excess_30to60=["Рекомендация 22","Рекомендация 23","Рекомендация 24"],
                 men_excess_after60=["Рекомендация 25","Рекомендация 26","Рекомендация 27"],
                 women_deficit_til30=["Рекомендация 28","Рекомендация 29","Рекомендация 30"],
                 women_deficit_30to60=["Рекомендация 31","Рекомендация 32","Рекомендация 33"],
                 women_deficit_after60=["Рекомендация 34","Рекомендация 35","Рекомендация 36"],
                 women_normal_til30=["Рекомендация 37","Рекомендация 38","Рекомендация 39"],
                 women_norml_30to60=["Рекомендация 40","Рекомендация 41","Рекомендация 42"],
                 women_normal_after60=["Рекомендация 43","Рекомендация 44","Рекомендация 45"],
                 women_excess_til30=["Рекомендация 46","Рекомендация 47","Рекомендация 48"],
                 women_excess_30to60=["Рекомендация 49","Рекомендация 50","Рекомендация 51"],
                 women_excess_after60=["Рекомендация 52","Рекомендация 53","Рекомендация 54"])

key = []

match sex:
    case "М":
        key.append("men")
    case "Ж":
        print("жен")
        key.append("women")

if bmi <= 18.5:
    print("Дефицит массы тела")
    key.append("deficit")
elif bmi > 18.5 and bmi <= 25:
    print("Нормальная масса тела")
    key.append("normal")
elif bmi > 25:
    print("Избыточная масса тела")
    key.append("excess")

if age <= 30:
    key.append("til30")
elif age > 30 and age < 60:
    key.append("30to60")
elif age >= 60:
    key.append("after60")

print("Рекомендуем Вам:", ', '.join(recomendations['_'.join(key)]))